{
  "settings": "Settings",
  "setting": "Setting",
  "generalSettings": "General settings",
  "environments": "Environments",
  "environmentName": "Environment name",
  "addEnvironment": "Add environment",
  "secret": "Secret",
  "secrets": "Secrets",
  "proxyServer": "Proxy server",
  "proxyServerInfo": "Specify your HTTP and HTTPS corporate proxy server settings below (optional).\nTo enable package downloads during cluster deployment in environments without direct internet access.",
  "addSecret": "Add secret",
  "secretType": "Secret type",
  "secretName": "Secret name",
  "addProject": "Add project",
  "projectName": "Project name",
  "settingsAwsSecretInfo": "Enter the access key to deploy the cluster to your AWS cloud provider account below. See the <0>official documentation</0> for instructions on creating an access key.",
  "settingsGcpSecretInfo": "Enter the service account content (in json or base64 format) to deploy the cluster to your Google Cloud provider account below. See the <0>official documentation</0> for instructions on creating an service account key.",
  "settingsDoSecretInfo": "Enter the API token to deploy the cluster to your DigitalOcean Cloud provider account below. See the <0>official documentation</0> for instructions on creating an access token.",
  "settingsAzureSecretInfo": "Enter the necessary details to deploy the cluster to your Azure Cloud provider account below. See the <0>official documentation</0> for instructions on creating an service principal.",
  "settingsHetznerSecretInfo": "Enter the API token to deploy the cluster to your Hetzner Cloud provider account below. See the <0>official documentation</0> for instructions on creating an access token.",
  "settingsSshKeySecretInfo": "Enter the contents of your private SSH key below to access the cluster servers via SSH. It is assumed that the corresponding public key has already been added to the servers.",
  "settingsPasswordSecretInfo": "Enter the SSH username and password below to access the cluster servers. It is assumed that the user account, such as root or one with sudo privileges, has already been created on the servers.",
  "settingsConfidentialDataStore": "All confidential data entered in these fields is stored in encrypted form.",
  "sshPrivateKey": "SSH private key",
  "month": "Month"
}